# Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, 
# в которой находится эта точка (или на какой оси она находится).


def quarter(x,y):
    qu=[['I','II'],['IV','III']]

    if y == 0 or x == 0:
         print('error')
        
    else:
        print(qu[y<0][x<0], ' четверть')
                
quarter(int(input('введите x: ')),int(input('введите y: ')))
